src/cf/InformationRegisters/AdditionalDataProcessorsPurposes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>AdditionalDataProcessorsPurposes</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>UseObjectFilling</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UseReports</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UseRelatedObjectCreation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>RelatedObject</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExtensionObjectIDs</v8:Type>
						<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>FormType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/AdditionalReportsAndDataProcessorsPublicationOptions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>AdditionalReportsAndDataProcessorsPublicationOptions</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Used</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DebugMode</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>isDisabled</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/AdditionalReportsAndDataProcessorsKinds.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>AdditionalReportsAndDataProcessorsKinds</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AdditionalDataProcessor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AdditionalReport</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ObjectFilling</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Report</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PrintForm</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RelatedObjectsCreation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MessageTemplate</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/AdditionalReportsAndDataProcessors.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>AdditionalReportsAndDataProcessors</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SafeMode</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Version</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Kind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AdditionalReportsAndDataProcessorsKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ObjectName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Information</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseForObjectForm</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseForListForm</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmployeeResponsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Publication</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AdditionalReportsAndDataProcessorsPublicationOptions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SettingsStorage</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataProcessorStorage</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseOptionStorage</Name>
					<Comment>When the Truth is that a supplementary report is attached to the storage options of "Chroniclesofarefugee".</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeepIntegrationWithReportForm</Name>
					<Comment>When the Truth is that the report has a programmatic interface for tight integration with the General form of "FormatData".</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PermissionsCompatibilityMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AdditionalReportsAndDataProcessorsPermissionCompatibilityModes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Commands</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>StartupOption</Name>
							<Type>
								<v8:Type>cfg:EnumRef.AdditionalDataProcessorsCallMethods</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ShouldShowUserNotification</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Modifier</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GUIDScheduledJob</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Hide</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CommandsToReplace</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Purpose</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>RelatedObject</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ExtensionObjectIDs</v8:Type>
								<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Sections</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Section</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ExtensionObjectIDs</v8:Type>
								<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Permissions</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>PermissionKind</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Parameters</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Comment>Value</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInfo</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/AdditionalDataProcessorsPurposes/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//  
// 
// 
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Private

// Collects directory data from metadata object references and updates the register data for them.
//
Procedure UpdateDataByMetadataObjectsRefs(MetadataObjectsRefs) Export
	Query = NewRegisterDataUpdateRequest(MetadataObjectsRefs);
	
	ReferencesSelection = Query.Execute().Select(QueryResultIteration.ByGroups);
	
	While ReferencesSelection.Next() Do
		RecordsSelection = ReferencesSelection.Select();
		While RecordsSelection.Next() Do
			RecordManager = CreateRecordManager();
			FillPropertyValues(RecordManager, RecordsSelection);
			RecordManager.Write(True);
		EndDo;
		
		// 
		MetadataObjectsRefs.Delete(MetadataObjectsRefs.Find(ReferencesSelection.RelatedObject));
	EndDo;
	
	// 
	For Each RelatedObject In MetadataObjectsRefs Do
		RecordSet = CreateRecordSet();
		RecordSet.Filter.RelatedObject.Set(RelatedObject);
		RecordSet.Write(True);
	EndDo;
EndProcedure

// Returns the request text that is used to update the register data.
//
Function NewRegisterDataUpdateRequest(MetadataObjectsRefs)
	
	Query = New Query;
	
	QueryText =
	"SELECT DISTINCT
	|	AdditionalReportsAndDataProcessorsAssignment.RelatedObject AS RelatedObject,
	|	CASE
	|		WHEN AdditionalReportsAndDataProcessorsAssignment.Ref.Kind = &KindObjectFilling
	|			THEN TRUE
	|		ELSE FALSE
	|	END AS UseObjectFilling,
	|	CASE
	|		WHEN AdditionalReportsAndDataProcessorsAssignment.Ref.Kind = &KindOfReport
	|			THEN TRUE
	|		ELSE FALSE
	|	END AS UseReports,
	|	CASE
	|		WHEN AdditionalReportsAndDataProcessorsAssignment.Ref.Kind = &KindCreateRelatedObjects
	|			THEN TRUE
	|		ELSE FALSE
	|	END AS UseRelatedObjectCreation,
	|	AdditionalReportsAndDataProcessorsAssignment.Ref.UseForObjectForm,
	|	AdditionalReportsAndDataProcessorsAssignment.Ref.UseForListForm
	|INTO ttPrimaryData
	|FROM
	|	Catalog.AdditionalReportsAndDataProcessors.Purpose AS AdditionalReportsAndDataProcessorsAssignment
	|WHERE
	|	AdditionalReportsAndDataProcessorsAssignment.RelatedObject IN(&MetadataObjectsRefs)
	|	AND AdditionalReportsAndDataProcessorsAssignment.Ref.Publication <> &PublicationNotEqual
	|	AND AdditionalReportsAndDataProcessorsAssignment.Ref.DeletionMark = FALSE
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	ObjectForms.RelatedObject,
	|	FALSE AS UseObjectFilling,
	|	ObjectForms.UseReports,
	|	ObjectForms.UseRelatedObjectCreation,
	|	&ObjectFormType AS FormType
	|INTO ttResult
	|FROM
	|	ttPrimaryData AS ObjectForms
	|WHERE
	|	ObjectForms.UseForObjectForm = TRUE
	|
	|UNION ALL
	|
	|SELECT
	|	DisabledObjectForms.RelatedObject,
	|	FALSE,
	|	FALSE,
	|	FALSE,
	|	&ObjectFormType
	|FROM
	|	ttPrimaryData AS DisabledObjectForms
	|WHERE
	|	DisabledObjectForms.UseForObjectForm = FALSE
	|
	|UNION ALL
	|
	|SELECT
	|	ListForms.RelatedObject,
	|	ListForms.UseObjectFilling,
	|	ListForms.UseReports,
	|	ListForms.UseRelatedObjectCreation,
	|	&ListFormType
	|FROM
	|	ttPrimaryData AS ListForms
	|WHERE
	|	ListForms.UseForListForm = TRUE
	|
	|UNION ALL
	|
	|SELECT
	|	DisabledListForms.RelatedObject,
	|	FALSE,
	|	FALSE,
	|	FALSE,
	|	&ListFormType
	|FROM
	|	ttPrimaryData AS DisabledListForms
	|WHERE
	|	DisabledListForms.UseForListForm = FALSE
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	tabResult.RelatedObject AS RelatedObject,
	|	tabResult.FormType,
	|	MAX(tabResult.UseObjectFilling) AS UseObjectFilling,
	|	MAX(tabResult.UseReports) AS UseReports,
	|	MAX(tabResult.UseRelatedObjectCreation) AS UseRelatedObjectCreation
	|FROM
	|	ttResult AS tabResult
	|
	|GROUP BY
	|	tabResult.RelatedObject,
	|	tabResult.FormType
	|TOTALS BY
	|	RelatedObject";
	
	If MetadataObjectsRefs = Undefined Then
		QueryText = StrReplace(
			QueryText,
			"AdditionalReportsAndDataProcessorsAssignment.RelatedObject IN(&MetadataObjectsRefs)
			|	AND ",
			"");
	Else
		Query.SetParameter("MetadataObjectsRefs", MetadataObjectsRefs);
	EndIf;
	
	Query.SetParameter("PublicationNotEqual", Enums.AdditionalReportsAndDataProcessorsPublicationOptions.isDisabled);
	Query.SetParameter("KindObjectFilling",         Enums.AdditionalReportsAndDataProcessorsKinds.ObjectFilling);
	Query.SetParameter("KindOfReport",                     Enums.AdditionalReportsAndDataProcessorsKinds.Report);
	Query.SetParameter("KindPrintForm",             Enums.AdditionalReportsAndDataProcessorsKinds.PrintForm);
	Query.SetParameter("KindCreateRelatedObjects", Enums.AdditionalReportsAndDataProcessorsKinds.RelatedObjectsCreation);
	Query.SetParameter("ListFormType",  AdditionalReportsAndDataProcessorsClientServer.ListFormType());
	Query.SetParameter("ObjectFormType", AdditionalReportsAndDataProcessorsClientServer.ObjectFormType());
	Query.Text = QueryText;
	
	Return Query;
EndFunction

#EndRegion

#EndIf
